views/books/view.php


$user_id = Yii::$app->user->ID;

$user = Readers::findOne(['ID' => $user_id]);
---
SELECT * FROM `Readers` WHERE `ID`=86

                    <p ><strong class='strong'>Availability:</strong> <?=$model->CurrentAmount?>/<?=$model->TotalAmount?></p>
                </div>
                <?php
                    if($books = BookGenres::findAll(['BookID' => $model->ID])){
---
SELECT * FROM `BookGenres` WHERE `BookID`=19

                            <p><strong class='strong'>Genres:</strong></p><?php
                            $i = 1;
                            foreach($books as $book){
                                $genre = Genres::findOne(['ID' => $book->GenreID]);
---
SELECT * FROM `Genres` WHERE `ID`=3