views/rented-books/taken-books.php

SELECT * FROM `RentedBooks` WHERE (`ReaderID`='86') AND (`ReturnedDate` IS NULL)
SELECT * FROM `Readers` WHERE `ID`=86
---

$this->title = 'Taken Books';
$this->registerCssFile('@web/css/orders_3.css');
$books = RentedBooks::findAll(['ReaderID' => $user_id, 'ReturnedDate' => NULL]);
$user_id = Yii::$app->user->ID;
$user = Readers::findOne(['ID' => $user_id]);

SELECT * FROM `Books` WHERE `ID`=19
---
                    if(date($books[$index]['ReturnDate'], strtotime('-10 days')) < date('Y-m-d h:i:s')){
                        $is_overdue = TRUE;
                    }
                    $book = Books::findOne(['ID' => $books[$index]['BookID']]);