views/reserved-books/current-order.php

?>
<div class="reserved-books-current-order">
    <?php if(!empty(Yii::$app->session->get('order'))) { ?>
        <?php $user = Readers::findOne(['ID' => Yii::$app->session->get('usr_id')]);
---
SELECT * FROM `Readers` WHERE `ID`=86

                $order = Yii::$app->session->get('order');
                foreach ($order as $key=>$value) {
                    foreach ($value as $id=>$amount) {
                        $book = Books::findOne(['ID' => $id]);
---
SELECT * FROM `Books` WHERE `ID`=20