views/reserved-books/reserved-books-user.php

SELECT * FROM `Readers` WHERE `ID`=86
---
$this->registerCssFile('@web/css/orders_2.css');
$user_id = $user;

$user = Readers::findOne(['ID' => Yii::$app->user->ID]);

SELECT * FROM `Books` WHERE `ID`=20
---

            <?php
                foreach ($books as $index=>$data){
                    $book = Books::findOne(['ID' => $books[$index]['BookID']]);