controllers/BooksController.php

SELECT * FROM `Books` WHERE `ID`='19'
---
    protected function findModel($ID)
    {
        if (($model = Books::findOne(['ID' => $ID])) !== null) {