controllers/RentedBooksController.php

SELECT * FROM `RentedBooks` WHERE `ID`='83'
---
    protected function findModel($ID)
    {
        if (($model = RentedBooks::findOne(['ID' => $ID])) !== null) {

SELECT EXISTS(SELECT * FROM `Readers` WHERE `Readers`.`ID`=86)
SELECT * FROM `Readers` WHERE `ID`='86'
SELECT * FROM `ReservedBooks` WHERE `ReaderID`=86
INSERT INTO `RentedBooks` (`BookID`, `ReaderID`, `TakenDate`, `ReturnDate`, `Amount`) VALUES (19, 86, '2023-04-19 15:33:14', '2023-05-19 15:33:14', 1)
SELECT EXISTS(SELECT * FROM `Books` WHERE `Books`.`ID`=19)
SELECT * FROM `ReservedBooks` WHERE `ID`=330
DELETE FROM `ReservedBooks` WHERE `ID`=330
SELECT * FROM `Books` WHERE `ID`=19
UPDATE `Books` SET `CurrentAmount`=11 WHERE `ID`=19
---
    public function actionApproveOrder($ID)
    {
        $usr_id = $ID;
        $user = Readers::findOne(['ID' => $usr_id]);
        $books = ReservedBooks::findAll(['ReaderID' => $user->ID]);
        foreach ($books as $index=>$data){
            $new_model = new RentedBooks();
            $new_model->BookID = $books[$index]['BookID'];
            $new_model->ReaderID = $books[$index]['ReaderID'];
            $new_model->TakenDate = date('Y-m-d H:i:s');
            $new_model->ReturnDate = date('Y-m-d H:i:s', strtotime('+30 days'));
            $new_model->Amount = $books[$index]['Amount'];
            $new_model->save();
            $id = $books[$index]['ID'];
            $model = ReservedBooks::findOne(['ID' => $id]);
            $model->delete();
            $book = Books::findOne(['ID' => $books[$index]['BookID']]);
            $book->CurrentAmount -= $books[$index]['Amount'];
            $book->save(false);

SELECT EXISTS(SELECT * FROM `Books` WHERE `Books`.`ID`=19)
SELECT * FROM `Books` WHERE `ID`=19
UPDATE `Books` SET `CurrentAmount`=12 WHERE `ID`=19
---
    public function actionReturnBook($id)
    {
        $model = $this->findModel($id);

        $model->ReturnDate = NULL;

        $model->ReturnedDate = date('Y-m-d H:i:s');

        $book = Books::findOne(['ID' => $model->BookID]);

        $book->CurrentAmount += $model->Amount;

        $book->save();