controllers/ReservedBooksController.php

    public function actionSubmitOrder()
    {
        $order = Yii::$app->session->get('order');
        $usr_id = $_SESSION['usr_id'];

        if ($this->request->isPost) {
            foreach ($order as $key=>$value) {
                foreach ($value as $id=>$amount) {
                    $model = new ReservedBooks();
                    $model->BookID = $id;
                    $model->ReaderID = $_SESSION['usr_id'];
                    $model->Date = date('Y-m-d H:i:s');
                    $model->Amount = $amount;
                    $model->save();
                    $book = Books::findOne(['ID' => $id]);
                    $book->CurrentAmount -= $amount;
                    $book->save();
---
INSERT INTO `ReservedBooks` (`BookID`, `ReaderID`, `Date`, `Amount`) VALUES (19, 86, '2023-04-19 15:33:13', 1)
SELECT EXISTS(SELECT * FROM `Books` WHERE `Books`.`ID`=19)
SELECT * FROM `Books` WHERE `ID`=19
UPDATE `Books` SET `CurrentAmount`=11 WHERE `ID`=19

    protected function findModel($ID)
    {
        if (($model = ReservedBooks::findOne(['ID' => $ID])) !== null) {
---
SELECT * FROM `ReservedBooks` WHERE `ID`='329'

    public function actionReservedBooksUser($userID)
    {
        $books = ReservedBooks::findAll(['ReaderID' => $userID]);
---
SELECT * FROM `ReservedBooks` WHERE `ReaderID`='86'