controllers/SiteController.php

SELECT COUNT(*) FROM `Books`
SELECT * FROM `Books` LIMIT 25
---
    public function actionCatalogue()
    {
        $books = Books::find();

        $totalCount = $books->count();
        $pagination = new Pagination([
            'defaultPageSize' => 25,
            'totalCount' => $totalCount,
        ]);

        $books = $books->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();