views/site/catalogue.php

SELECT * FROM `Genres`
---
    $selected_genres = null;
}

$genres = Genres::find()->all();