models/Readers.php

    public static function findIdentity($id)
    {
        return static::findOne(['ID' => $id]);
---
SELECT * FROM `Readers` WHERE `ID`=86